neon-smart-studio/W-Link_NeonRTOS_STM32/src/W-Link/Driver/GPIO/Device/GPIO_STM32F7.c
#ifdef GPIO_SPEED_FREQ_VERY_HIGH
    gpio_pin_init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
#else
    gpio_pin_init.Speed = GPIO_SPEED_FREQ_HIGH;
#endif

    HAL_GPIO_Init(soc_base, &gpio_pin_init);

    gpio_current_dir[pin] = dir;
    
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Pin_Get_Direction(hwGPIO_Pin pin, hwGPIO_Direction* dir)
{
    if(pin>=hwGPIO_Pin_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
    
    if(dir==NULL)
    {
      return hwGPIO_InvalidParameter;
    }

    *dir = gpio_current_dir[pin];
  
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Pin_Set_PullMode(hwGPIO_Pin pin, hwGPIO_Pull_Mode pull_mode)
{
    if(pin>=hwGPIO_Pin_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
    
    if(pull_mode>=hwGPIO_Pull_Mode_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
  
    uint16_t soc_pin = GPIO_Map_Soc_Pin(pin);
    GPIO_TypeDef * soc_base = GPIO_Map_Soc_Base(pin);

    if(soc_pin==0 || soc_base==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
    
    GPIO_InitTypeDef gpio_pin_init = {0};
    gpio_pin_init.Pin = soc_pin;

    switch(gpio_current_dir[pin])
    {
        case hwGPIO_Direction_Input:
            gpio_pin_init.Mode = GPIO_MODE_INPUT;
            break;
        case hwGPIO_Direction_Output:
        case hwGPIO_Direction_Output_Only:
            switch(pull_mode)
            {
                case hwGPIO_Pull_Mode_None:
                    gpio_pin_init.Mode = GPIO_MODE_OUTPUT_PP;
                    gpio_pin_init.Pull = GPIO_NOPULL;
                    break;
                case hwGPIO_Pull_Mode_Up:
                    gpio_pin_init.Mode = GPIO_MODE_OUTPUT_PP;
                    gpio_pin_init.Pull = GPIO_PULLUP;
                    break;
                case hwGPIO_Pull_Mode_Down:
                    gpio_pin_init.Mode = GPIO_MODE_OUTPUT_PP;
                    gpio_pin_init.Pull = GPIO_PULLDOWN;
                    break;
                case hwGPIO_Pull_Mode_OpenDrain:
                    gpio_pin_init.Mode = GPIO_MODE_OUTPUT_OD;
                    break;
            }
            break;
    }
    
#ifdef GPIO_SPEED_FREQ_VERY_HIGH
    gpio_pin_init.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
#else
    gpio_pin_init.Speed = GPIO_SPEED_FREQ_HIGH;
#endif

    HAL_GPIO_Init(soc_base, &gpio_pin_init);

    gpio_current_mode[pin] = pull_mode;
    
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Pin_Get_PullMode(hwGPIO_Pin pin, hwGPIO_Pull_Mode* pull_mode)
{
    if(pin>=hwGPIO_Pin_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
    
    if(pull_mode==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
  
    *pull_mode = gpio_current_mode[pin];
  
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Pin_Read(hwGPIO_Pin pin, bool* level)
{
    if(pin>=hwGPIO_Pin_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
    
    if(level==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
    
    if(gpio_current_dir[pin]==hwGPIO_Direction_Output_Only)
    {
      return hwGPIO_Unsupport;
    }

    uint16_t soc_pin = GPIO_Map_Soc_Pin(pin);
    GPIO_TypeDef * soc_base = GPIO_Map_Soc_Base(pin);

    if(soc_pin==0 || soc_base==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
    
    *level = (HAL_GPIO_ReadPin(soc_base, soc_pin)==GPIO_PIN_SET) ? 1: 0;
    
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Pin_Write(hwGPIO_Pin pin, bool level)
{
    if(pin>=hwGPIO_Pin_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
  
    if(gpio_current_dir[pin]==hwGPIO_Direction_Input)
    {
      return hwGPIO_Unsupport;
    }

    uint16_t soc_pin = GPIO_Map_Soc_Pin(pin);
    GPIO_TypeDef * soc_base = GPIO_Map_Soc_Base(pin);

    if(soc_pin==0 || soc_base==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
    
    if(level)
    {
      HAL_GPIO_WritePin(soc_base, soc_pin, GPIO_PIN_SET);
    }
    else
    {
      HAL_GPIO_WritePin(soc_base, soc_pin, GPIO_PIN_RESET);
    }
    
    return hwGPIO_OK;
}

hwGPIO_OpStatus GPIO_Pin_Toggle(hwGPIO_Pin pin)
{
    if(pin>=hwGPIO_Pin_MAX)
    {
      return hwGPIO_InvalidParameter;
    }
  
    if(gpio_current_dir[pin]==hwGPIO_Direction_Input)
    {
      return hwGPIO_Unsupport;
    }

    uint16_t soc_pin = GPIO_Map_Soc_Pin(pin);
    GPIO_TypeDef * soc_base = GPIO_Map_Soc_Base(pin);

    if(soc_pin==0 || soc_base==NULL)
    {
      return hwGPIO_InvalidParameter;
    }
    
    HAL_GPIO_TogglePin(soc_base, soc_pin);
    
    return hwGPIO_OK;
}

static void GPIO_EXTI_Dispatch(GPIO_EXTI_Line line)
{
    GPIO_EXTI_Desc *d = &gpio_exti_desc[line];

    uint16_t soc_pin = GPIO_Int_Map_Soc_Pin(d->irq_pin);
    GPIO_TypeDef * soc_base = GPIO_Int_Map_Soc_Base(d->irq_pin);

    if(soc_pin==0 || soc_base==NULL)
    {
      return;
    }
    
    if (__HAL_GPIO_EXTI_GET_IT(soc_pin) == RESET)
        return;

    __HAL_GPIO_EXTI_CLEAR_IT(soc_pin);

    if(gpio_irq_handlers[d->irq_pin]!=NULL)
    {
        switch(d->mode)
        {
          case hwGPIO_Interrupt_Mode_Falling_Edge:
            gpio_irq_handlers[d->irq_pin](d->irq_pin, hwGPIO_Interrupt_Action_Falling_Edge);
            break;
          case hwGPIO_Interrupt_Mode_Rising_Edge:
            gpio_irq_handlers[d->irq_pin](d->irq_pin, hwGPIO_Interrupt_Action_Rising_Edge);
            break;
          case hwGPIO_Interrupt_Mode_Both_Edge:
            gpio_irq_handlers[d->irq_pin](d->irq_pin, hwGPIO_Interrupt_Action_Toggle);
            break;
        }
    }
}

void EXTI0_IRQHandler(void) { GPIO_EXTI_Dispatch(GPIO_EXTI_Line_0); }
void EXTI1_IRQHandler(void) { GPIO_EXTI_Dispatch(GPIO_EXTI_Line_1); }
void EXTI2_IRQHandler(void) { GPIO_EXTI_Dispatch(GPIO_EXTI_Line_2); }
void EXTI3_IRQHandler(void) { GPIO_EXTI_Dispatch(GPIO_EXTI_Line_3); }
void EXTI4_IRQHandler(void) { GPIO_EXTI_Dispatch(GPIO_EXTI_Line_4); }
void EXTI9_5_IRQHandler(void)
{
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_5);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_6);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_7);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_8);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_9);
}
void EXTI15_10_IRQHandler(void)
{
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_10);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_11);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_12);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_13);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_14);
  GPIO_EXTI_Dispatch(GPIO_EXTI_Line_15);
}

static GPIO_EXTI_Line GPIO_Map_EXTI_Line_Index(uint32_t exti_line)
{
    switch(exti_line)
    {
        case EXTI_LINE_0:
            return GPIO_EXTI_Line_0;
        case EXTI_LINE_1:
            return GPIO_EXTI_Line_1;
        case EXTI_LINE_2:
            return GPIO_EXTI_Line_2;
        case EXTI_LINE_3:
            return GPIO_EXTI_Line_3;
        case EXTI_LINE_4:
            return GPIO_EXTI_Line_4;
        case EXTI_LINE_5:
            return GPIO_EXTI_Line_5;
        case EXTI_LINE_6:
            return GPIO_EXTI_Line_6;
        case EXTI_LINE_7:
            return GPIO_EXTI_Line_7;
        case EXTI_LINE_8:
            return GPIO_EXTI_Line_8;
        case EXTI_LINE_9:
            return GPIO_EXTI_Line_9;
        case EXTI_LINE_10:
            return GPIO_EXTI_Line_10;
        case EXTI_LINE_11:
            return GPIO_EXTI_Line_11;
        case EXTI_LINE_12:
            return GPIO_EXTI_Line_12;
        case EXTI_LINE_13:
            return GPIO_EXTI_Line_13;
        case EXTI_LINE_14:
            return GPIO_EXTI_Line_14;
        case EXTI_LINE_15:
            return GPIO_EXTI_Line_15;
    }
    return GPIO_EXTI_Line_MAX;
}

hwGPIO_OpStatus GPIO_Interrupt_Init(hwGPIO_Int_Pin irq_pin, hwGPIO_Interrupt_Mode mode)
{
    if(irq_pin>=hwGPIO_Int_Pin_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
    if(mode>=hwGPIO_Interrupt_Mode_MAX)
    {
        return hwGPIO_InvalidParameter;
    }
  
